app/controllers/physicians_controller.rb

  def index
    @physicians = Physician.all
---
SELECT "physicians".* FROM "physicians"

  def create
    @physician = Physician.new(physician_params)

    respond_to do |format|
      if @physician.save
---
INSERT INTO "physicians" ("physician_id", "name", "email", "unique_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["physician_id", nil], ["name", "vinayak"], ["email", "ldsnsdihfcds"], ["unique_id", 60], ["created_at", "2022-05-09 05:28:25.045732"], ["updated_at", "2022-05-09 05:28:25.045732"]]

    def set_physician
      @physician = Physician.find(params[:id])
---
SELECT "physicians".* FROM "physicians" WHERE "physicians"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]