app/models/physician.rb

SELECT "physicians".* FROM "physicians" WHERE "physicians"."unique_id" = ?  [["unique_id", 60]]
---
        def add_unique_id
            unique = SecureRandom.uuid
            while Physician.where(unique_id: unique).length != 0